# Завдання 1
# Користувач вводить із клавіатури три числа. Необхідно знайти суму чисел, добуток чисел.
# Результат обчислень вивести на екран.

a = int(input("Введіть число 1 "))
b = int(input("Введіть число 2 "))
c = int(input("Введіть число 3 "))
suma = a+b+c
dob = a*b*c
print(f"Сума чисел {suma}, Добуток {dob};")
# Завдання 2
# Користувач вводить із клавіатури три числа. Перше число — зарплата за місяць, друге число
# — сума місячного платежу за кредитом у банку, третє число ­— заборгованість за комунальні послуги.
# Необхідно вивести на екран суму, яка залишиться у користувача після всіх виплат.#
a1 = int(input("Введіть зарплату "))
b1 = int(input("Введіть кредит банк "))
c1 = int(input("Введіть омуналка "))
last = a1 - (b1+c1)
print(f"остаток {last}")

# Завдання 3
#Напишіть програму, що обчислює площу ромба. Користувач вводить
# із клавіатури довжину двох його діагоналей.
d1 = int(input("Введіть довжину 1 діагоналі "))
d2 = int(input("Введіть довжину 2 діагоналі "))
ploscha = (d1*d2)/2
print(f"Площа ромба {ploscha}")